zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F83xxx/MC56F83789/MC56F83789_COMMON.h
/*
** ###################################################################
**     Processors:          MC56F83789AVLL
**                          MC56F83789VLL
**
**     Compiler:            CodeWarrior C/C++ for DSP M56800E
**     Reference manual:    Manual version TBD
**     Version:             rev. 1.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         Peripheral Access Layer for MC56F83789
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2019-09-23)
**         Initial version.
**     - rev. 1.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file MC56F83789_COMMON.h
 * @version 1.0
 * @date 2024-10-29
 * @brief Peripheral Access Layer for MC56F83789
 *
 * Peripheral Access Layer for MC56F83789
 */

#if !defined(MC56F83789_COMMON_H_)
#define MC56F83789_COMMON_H_                     /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt IRQ numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_IRQ_numbers Interrupt IRQ numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_IRQ    103                 /**< Number of interrupts in the IRQ table */

typedef enum IRQn {
  /* Device specific interrupts */
  STPCNT_IRQn                  = 0,                /**< STPCNT interrupt */
  BKPT_IRQn                    = 1,                /**< BKPT interrupt */
  TRBUF_IRQn                   = 2,                /**< TRBUF interrupt */
  TX_REG_IRQn                  = 3,                /**< TX_REG interrupt */
  RX_REG_IRQn                  = 4,                /**< RX_REG interrupt */
  BUS_ERR_IRQn                 = 5,                /**< BUS_ERR interrupt */
  Reserved6_IRQn               = 6,                /**< Reserved interrupt */
  Reserved7_IRQn               = 7,                /**< Reserved interrupt */
  Reserved8_IRQn               = 8,                /**< Reserved interrupt */
  XBARA_IRQn                   = 9,                /**< XBARA interrupt */
  LVI1_IRQn                    = 10,               /**< LVI1 interrupt */
  OCCS_IRQn                    = 11,               /**< OCCS interrupt */
  TMRB_3_IRQn                  = 12,               /**< TMRB_3 interrupt */
  TMRB_2_IRQn                  = 13,               /**< TMRB_2 interrupt */
  TMRB_1_IRQn                  = 14,               /**< TMRB_1 interrupt */
  TMRB_0_IRQn                  = 15,               /**< TMRB_0 interrupt */
  TMRA_3_IRQn                  = 16,               /**< TMRA_3 interrupt */
  TMRA_2_IRQn                  = 17,               /**< TMRA_2 interrupt */
  TMRA_1_IRQn                  = 18,               /**< TMRA_1 interrupt */
  TMRA_0_IRQn                  = 19,               /**< TMRA_0 interrupt */
  ADC12_CC1_IRQn               = 20,               /**< ADC12_CC1 interrupt */
  ADC12_CC0_IRQn               = 21,               /**< ADC12_CC0 interrupt */
  ADC12_ERR_IRQn               = 22,               /**< ADC12_ERR interrupt */
  DMA_ERR_IRQn                 = 23,               /**< DMA_ERR interrupt */
  DMA3_IRQn                    = 24,               /**< DMA3 interrupt */
  DMA2_IRQn                    = 25,               /**< DMA2 interrupt */
  DMA1_IRQn                    = 26,               /**< DMA1 interrupt */
  DMA0_IRQn                    = 27,               /**< DMA0 interrupt */
  CAN_MB_OR_IRQn               = 28,               /**< CAN_MB_OR interrupt */
  CAN_BUS_OFF_IRQn             = 29,               /**< CAN_BUS_OFF interrupt */
  CAN_ERROR_IRQn               = 30,               /**< CAN_ERROR interrupt */
  CAN_TX_WARN_IRQn             = 31,               /**< CAN_TX_WARN interrupt */
  CAN_RX_WARN_IRQn             = 32,               /**< CAN_RX_WARN interrupt */
  CAN_WAKEUP_IRQn              = 33,               /**< CAN_WAKEUP interrupt */
  QSCI2_RERR_IRQn              = 34,               /**< QSCI2_RERR interrupt */
  QSCI2_RCV_IRQn               = 35,               /**< QSCI2_RCV interrupt */
  QSCI2_TRIDLE_IRQn            = 36,               /**< QSCI2_TRIDLE interrupt */
  QSCI2_TDRE_IRQn              = 37,               /**< QSCI2_TDRE interrupt */
  QSCI1_RERR_IRQn              = 38,               /**< QSCI1_RERR interrupt */
  QSCI1_RCV_IRQn               = 39,               /**< QSCI1_RCV interrupt */
  QSCI1_TRIDLE_IRQn            = 40,               /**< QSCI1_TRIDLE interrupt */
  QSCI1_TDRE_IRQn              = 41,               /**< QSCI1_TDRE interrupt */
  QSCI0_RERR_IRQn              = 42,               /**< QSCI0_RERR interrupt */
  QSCI0_RCV_IRQn               = 43,               /**< QSCI0_RCV interrupt */
  QSCI0_TRIDLE_IRQn            = 44,               /**< QSCI0_TRIDLE interrupt */
  QSCI0_TDRE_IRQn              = 45,               /**< QSCI0_TDRE interrupt */
  Reserved46_IRQn              = 46,               /**< Reserved interrupt */
  Reserved47_IRQn              = 47,               /**< Reserved interrupt */
  QSPI1_XMIT_IRQn              = 48,               /**< QSPI1_XMIT interrupt */
  QSPI1_RCV_IRQn               = 49,               /**< QSPI1_RCV interrupt */
  QSPI0_XMIT_IRQn              = 50,               /**< QSPI0_XMIT interrupt */
  QSPI0_RCV_IRQn               = 51,               /**< QSPI0_RCV interrupt */
  I2C1_IRQn                    = 52,               /**< I2C1 interrupt */
  I2C0_IRQn                    = 53,               /**< I2C0 interrupt */
  Reserved54_IRQn              = 54,               /**< Reserved interrupt */
  Reserved55_IRQn              = 55,               /**< Reserved interrupt */
  Reserved56_IRQn              = 56,               /**< Reserved interrupt */
  eFlexPWMB_FAULT_IRQn         = 57,               /**< eFlexPWMB_FAULT interrupt */
  eFlexPWMB_RERR_IRQn          = 58,               /**< eFlexPWMB_RERR interrupt */
  eFlexPWMB_CAP_IRQn           = 59,               /**< eFlexPWMB_CAP interrupt */
  eFlexPWMB_RELOAD3_IRQn       = 60,               /**< eFlexPWMB_RELOAD3 interrupt */
  eFlexPWMB_CMP3_IRQn          = 61,               /**< eFlexPWMB_CMP3 interrupt */
  eFlexPWMB_RELOAD2_IRQn       = 62,               /**< eFlexPWMB_RELOAD2 interrupt */
  eFlexPWMB_CMP2_IRQn          = 63,               /**< eFlexPWMB_CMP2 interrupt */
  eFlexPWMB_RELOAD1_IRQn       = 64,               /**< eFlexPWMB_RELOAD1 interrupt */
  eFlexPWMB_CMP1_IRQn          = 65,               /**< eFlexPWMB_CMP1 interrupt */
  eFlexPWMB_RELOAD0_IRQn       = 66,               /**< eFlexPWMB_RELOAD0 interrupt */
  eFlexPWMB_CMP0_IRQn          = 67,               /**< eFlexPWMB_CMP0 interrupt */
  eFlexPWMA_FAULT_IRQn         = 68,               /**< eFlexPWMA_FAULT interrupt */
  eFlexPWMA_RERR_IRQn          = 69,               /**< eFlexPWMA_RERR interrupt */
  eFlexPWMA_CAP_IRQn           = 70,               /**< eFlexPWMA_CAP interrupt */
  eFlexPWMA_RELOAD3_IRQn       = 71,               /**< eFlexPWMA_RELOAD3 interrupt */
  eFlexPWMA_CMP3_IRQn          = 72,               /**< eFlexPWMA_CMP3 interrupt */
  eFlexPWMA_RELOAD2_IRQn       = 73,               /**< eFlexPWMA_RELOAD2 interrupt */
  eFlexPWMA_CMP2_IRQn          = 74,               /**< eFlexPWMA_CMP2 interrupt */
  eFlexPWMA_RELOAD1_IRQn       = 75,               /**< eFlexPWMA_RELOAD1 interrupt */
  eFlexPWMA_CMP1_IRQn          = 76,               /**< eFlexPWMA_CMP1 interrupt */
  eFlexPWMA_RELOAD0_IRQn       = 77,               /**< eFlexPWMA_RELOAD0 interrupt */
  eFlexPWMA_CMP0_IRQn          = 78,               /**< eFlexPWMA_CMP0 interrupt */
  FTFE_RDCOL_IRQn              = 79,               /**< FTFE_RDCOL interrupt */
  FTFE_CC_IRQn                 = 80,               /**< FTFE_CC interrupt */
  CMPD_IRQn                    = 81,               /**< CMPD interrupt */
  CMPC_IRQn                    = 82,               /**< CMPC interrupt */
  CMPB_IRQn                    = 83,               /**< CMPB interrupt */
  CMPA_IRQn                    = 84,               /**< CMPA interrupt */
  PIT1_ROLLOVR_IRQn            = 85,               /**< PIT1_ROLLOVR interrupt */
  PIT0_ROLLOVR_IRQn            = 86,               /**< PIT0_ROLLOVR interrupt */
  FTFE_DFD_IRQn                = 87,               /**< FTFE_DFD interrupt */
  Reserved88_IRQn              = 88,               /**< Reserved interrupt */
  Reserved89_IRQn              = 89,               /**< Reserved interrupt */
  Reserved90_IRQn              = 90,               /**< Reserved interrupt */
  Reserved91_IRQn              = 91,               /**< Reserved interrupt */
  GPIOG_IRQn                   = 92,               /**< GPIOG interrupt */
  GPIOF_IRQn                   = 93,               /**< GPIOF interrupt */
  GPIOE_IRQn                   = 94,               /**< GPIOE interrupt */
  GPIOD_IRQn                   = 95,               /**< GPIOD interrupt */
  GPIOC_IRQn                   = 96,               /**< GPIOC interrupt */
  GPIOB_IRQn                   = 97,               /**< GPIOB interrupt */
  GPIOA_IRQn                   = 98,               /**< GPIOA interrupt */
  COP_INT_IRQn                 = 99,               /**< COP_INT interrupt */
  EWM_INT_IRQn                 = 100,              /**< EWM_INT interrupt */
  Reserved101_IRQn             = 101,              /**< Reserved interrupt */
  USB_IRQn                     = 102               /**< USB interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_IRQ_numbers */


/* ----------------------------------------------------------------------------
   -- Includes and Typedefs
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Includes_And_Typedes Includes and Typedefs
 * @{
 */

#include <stdint.h>

#define __IO volatile
#define __I const volatile
#define __O volatile

#ifdef __cplusplus
  typedef unsigned char uint8_t;
  typedef unsigned short uint16_t;
  typedef unsigned long uint32_t;
#endif

/*!
 * @}
 */ /* end of group Includes_And_Typedes */


#ifndef MC56F83789_SERIES
#define MC56F83789_SERIES
#endif
/* CPU specific feature definitions */
#include "MC56F83789_features.h"

/* ADC - Peripheral instance base addresses */
/** Peripheral ADC base address */
#define ADC_BASE                                 (0xE500u)
/** Peripheral ADC base pointer */
#define ADC                                      ((ADC_Type *)ADC_BASE)
/** Array initializer of ADC peripheral base addresses */
#define ADC_BASE_ADDRS                           { ADC_BASE }
/** Array initializer of ADC peripheral base pointers */
#define ADC_BASE_PTRS                            { ADC }

/* CAN - Peripheral instance base addresses */
/** Peripheral CAN0 base address */
#define CAN0_BASE                                (0xF000u)
/** Peripheral CAN0 base pointer */
#define CAN0                                     ((CAN_Type *)CAN0_BASE)
/** Array initializer of CAN peripheral base addresses */
#define CAN_BASE_ADDRS                           { CAN0_BASE }
/** Array initializer of CAN peripheral base pointers */
#define CAN_BASE_PTRS                            { CAN0 }
/** Interrupt vectors for the CAN peripheral type */
#define CAN_Rx_Warning_IRQS                      { CAN_RX_WARN_IRQn }
#define CAN_Tx_Warning_IRQS                      { CAN_TX_WARN_IRQn }
#define CAN_Wake_Up_IRQS                         { CAN_WAKEUP_IRQn }
#define CAN_Error_IRQS                           { CAN_ERROR_IRQn }
#define CAN_Bus_Off_IRQS                         { CAN_BUS_OFF_IRQn }
#define CAN_ORed_Message_buffer_IRQS             { CAN_MB_OR_IRQn }

/* CMP - Peripheral instance base addresses */
/** Peripheral CMPA base address */
#define CMPA_BASE                                (0xE020u)
/** Peripheral CMPA base pointer */
#define CMPA                                     ((CMP_Type *)CMPA_BASE)
/** Peripheral CMPB base address */
#define CMPB_BASE                                (0xE028u)
/** Peripheral CMPB base pointer */
#define CMPB                                     ((CMP_Type *)CMPB_BASE)
/** Peripheral CMPC base address */
#define CMPC_BASE                                (0xE030u)
/** Peripheral CMPC base pointer */
#define CMPC                                     ((CMP_Type *)CMPC_BASE)
/** Peripheral CMPD base address */
#define CMPD_BASE                                (0xE038u)
/** Peripheral CMPD base pointer */
#define CMPD                                     ((CMP_Type *)CMPD_BASE)
/** Array initializer of CMP peripheral base addresses */
#define CMP_BASE_ADDRS                           { CMPA_BASE, CMPB_BASE, CMPC_BASE, CMPD_BASE }
/** Array initializer of CMP peripheral base pointers */
#define CMP_BASE_PTRS                            { CMPA, CMPB, CMPC, CMPD }

/* COP - Peripheral instance base addresses */
/** Peripheral COP base address */
#define COP_BASE                                 (0xE320u)
/** Peripheral COP base pointer */
#define COP                                      ((COP_Type *)COP_BASE)
/** Array initializer of COP peripheral base addresses */
#define COP_BASE_ADDRS                           { COP_BASE }
/** Array initializer of COP peripheral base pointers */
#define COP_BASE_PTRS                            { COP }

